export class ApologiesDictionary {
    public static get MAIN(): string[] {
        return [
            'извините',
            'извини',
            'простите',
            'прости',
            'сорян',
            'сорички',
            'извиняюсь',
            'виноват',
            'пардон',
            'не взыщи',
            'не осуди',
            'не обессудь',
        ];
    }

    public static get TARGET(): string[] {
        return [
            'меня',
            'друзья',
            'товарищи',
            'братишка',
            'брат',
            'уважаемый',
            'молодые люди',
            'собаки сутулые',
            'борян',
            'псины',
            'ребятишки',
            'господа',
        ];
    }

    public static get ADDITIONAL(): string[] {
        return [
            ', очень надо',
            'хули',
            'прошу',
            'не гневайте',
            'слава украине',
            'цеж не со зла',
            'любимые',
            'ебучие',
            'ссаные',
            'сраные',
        ];
    }
}